app/controllers/class_locations_controller.rb

  def index
    @class_locations = ClassLocation.all
---
SELECT * FROM "class_locations"

  def show
    @class_location = ClassLocation.find(params[:id])
---
SELECT * FROM "class_locations" WHERE ("class_locations"."id" = 1)

  def create
    @class_location = ClassLocation.new(params[:class_location])

    respond_to do |format|
      if @class_location.save
---
INSERT INTO "class_locations" ("name", "city", "zip", "updated_at", "address_1", "description", "address_2", "state", "created_at") VALUES('JavaVino', 'Atlanta', '30307', '2009-04-22 02:47:32', '579 N Highland Ave NE', 'A coffee and wine house located in the Poncey-Highlands neighborhood of Atlanta, GA. They offer a plethora of coffees and wines from around the world