app/controllers/class_schedules_controller.rb

SELECT * FROM "class_schedules"
---
  def index
    @class_schedules = ClassSchedule.all

SELECT * FROM "class_schedules" WHERE ("class_schedules"."id" = 2)
---
  def show
    @class_schedule = ClassSchedule.find(params[:id])

SELECT * FROM "class_schedules" WHERE ("class_schedules"."id" = 1)
DELETE FROM "class_schedules" WHERE "id" = 1
---
  def destroy
    @class_schedule = ClassSchedule.find(params[:id])
    @class_schedule.destroy