app/controllers/courses_controller.rb

SELECT * FROM "courses"
---
  def index
    @courses = Course.all

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def edit
    @course = Course.find(params[:id])

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
UPDATE "courses" SET "description" = 'A Search Engine Optimization class targeted to the Small Business Owner with an emphasis on ranking well for local online search (Google Local).
---
  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])