app/controllers/home_controller.rb

INSERT INTO "leads" ("name", "message", "updated_at", "phone", "email", "created_at") VALUES('Rusty Zarse', NULL, '2009-04-23 13:46:12', '404 510 1134', 'rzarse@gmail.com', '2009-04-23 13:46:12')
---
  def lead_submit

    @lead = Lead.new(params[:lead])

    if not @lead.save