app/controllers/leads_controller.rb

  def index
    @leads = Lead.all
---
SELECT * FROM "leads"

  def show
    @lead = Lead.find(params[:id])
---
SELECT * FROM "leads" WHERE ("leads"."id" = 1)

  def create
    @lead = Lead.new(params[:lead])

    respond_to do |format|
      if @lead.save
---
INSERT INTO "leads" ("name", "message", "updated_at", "phone", "email", "created_at") VALUES('RUsty Zarse', NULL, '2009-04-23 06:26:59', '404-510-1134', 'rustyzarse@gmail.com', '2009-04-23 06:26:59')

  def destroy
    @lead = Lead.find(params[:id])
    @lead.destroy
---
SELECT * FROM "leads" WHERE ("leads"."id" = 1)
DELETE FROM "leads" WHERE "id" = 1